# 打好python基础很重要！

# 练习时间：2022/8/8 12:31
def func(a,b,c):
    print("a=",a)
    print("b=",b)
    print("c=",c)

# 参数的调用
func(10,20,30)  #函数调用时的参数传递，称为位置传参
print("----------------------")
lis = [11,22,33]
func(*lis)  #在函数调用时，将列表中的每个元素都转换为位置实参传入
print("----------------------")
func(a=10,b=20,c=30)  #关键字实参
print("----------------------")
dic = {"a":11,"b":22,"c":33}  #将字典中的键值对转换为位置实参传入
func(**dic)
print("----------------------")
def func1(a,b=10): #b是形参，且进行了赋值，故为默认值形参
    print("a=",a)
    print("b=",b)
def func2(*args1): #个数可变的位置参数
    print(args1)
def func3(**args2): #个数可变的关键字形参
    print(args2)

func2(10,20,30)  #结果为元组
print("---------------------------")
func3(a=11,b=22,c=33)  #结果为字典
print("---------------------------")

def func4(a,*,b,c): #从*之后的b,c只能采用关键字传参
    print("a=",a)
    print("b=", b)
    print("c=", c)

# func4(10,20,30) #位置传参
func4(a=11,b=22,c=33)
print("---------------------------")
func4(10,b=20,c=30)
# func4()

'''位置参数放在关键字参数前面'''
